JefkeB/LPCXpresso54608_LittlevGL/board/pin_mux.c
  const uint32_t port2_pin15_config =
      (/* Pin is configured as LCD_AC */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN15 (coords: M8) is configured as LCD_AC */
  IOCON_PinMuxSet(IOCON, 2U, 15U, port2_pin15_config);

  const uint32_t port2_pin16_config =
      (/* Pin is configured as LCD_LP */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN16 (coords: L8) is configured as LCD_LP */
  IOCON_PinMuxSet(IOCON, 2U, 16U, port2_pin16_config);

  const uint32_t port2_pin21_config =
      (/* Pin is configured as LCD_VD(3) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN21 (coords: L10) is configured as LCD_VD(3) */
  IOCON_PinMuxSet(IOCON, 2U, 21U, port2_pin21_config);

  const uint32_t port2_pin22_config =
      (/* Pin is configured as LCD_VD(4) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN22 (coords: K10) is configured as LCD_VD(4) */
  IOCON_PinMuxSet(IOCON, 2U, 22U, port2_pin22_config);

  const uint32_t port2_pin23_config =
      (/* Pin is configured as LCD_VD(5) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN23 (coords: M14) is configured as LCD_VD(5) */
  IOCON_PinMuxSet(IOCON, 2U, 23U, port2_pin23_config);

  const uint32_t port2_pin24_config =
      (/* Pin is configured as LCD_VD(6) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN24 (coords: K14) is configured as LCD_VD(6) */
  IOCON_PinMuxSet(IOCON, 2U, 24U, port2_pin24_config);

  const uint32_t port2_pin25_config =
      (/* Pin is configured as LCD_VD(7) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN25 (coords: J11) is configured as LCD_VD(7) */
  IOCON_PinMuxSet(IOCON, 2U, 25U, port2_pin25_config);

  const uint32_t port2_pin28_config =
      (/* Pin is configured as LCD_VD(10) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN28 (coords: G13) is configured as LCD_VD(10) */
  IOCON_PinMuxSet(IOCON, 2U, 28U, port2_pin28_config);

  const uint32_t port2_pin29_config =
      (/* Pin is configured as LCD_VD(11) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN29 (coords: G11) is configured as LCD_VD(11) */
  IOCON_PinMuxSet(IOCON, 2U, 29U, port2_pin29_config);

  const uint32_t port2_pin30_config =
      (/* Pin is configured as LCD_VD(12) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN30 (coords: F12) is configured as LCD_VD(12) */
  IOCON_PinMuxSet(IOCON, 2U, 30U, port2_pin30_config);

  const uint32_t port2_pin31_config =
      (/* Pin is configured as LCD_VD(13) */
       IOCON_PIO_FUNC1 |
       /* No addition pin function */
       IOCON_PIO_MODE_INACT |
       /* Input function is not inverted */
       IOCON_PIO_INV_DI |
       /* Enables digital function */
       IOCON_PIO_DIGITAL_EN |
       /* Input filter disabled */
       IOCON_PIO_INPFILT_OFF |
       /* Standard mode, output slew rate control is enabled */
       IOCON_PIO_SLEW_STANDARD |
       /* Open drain is disabled */
       IOCON_PIO_OPENDRAIN_DI);
  /* PORT2 PIN31 (coords: D14) is configured as LCD_VD(13) */
  IOCON_PinMuxSet(IOCON, 2U, 31U, port2_pin31_config);

